[Rainmeter]
Update=-1

[Metadata]
Name= Sonder 2
Author=mpurses
Information=Language Settings for the skins
Version=21.1.0
License=Creative Commons Attribution-Non-Commercial-Share Alike 3.0


[Variables]
@include=#@#Variables.inc

;dont do this, it will break for people with spaces in path
;FileToWrite=#@#Variables.inc
;VariableToWrite=Link
;VariableToWrite2=Link3
VariableToWrite3=LanginUse
VariableToWrite4=Language
VariableToWrite5=TimeFormatHourly
VariableToWrite9=Units

[MeterBack]
Meter=Image
W=310
H=470
SolidColor=26,27,28,255

[MeterBg]
Meter=Shape
X=0
Y=0
Shape=Rectangle 0.5,0.5,310,40 | Fill Color 0,0,0,0 | Stroke Color 0,0,0,0

[Exit]
Meter=IMAGE
ImageName=#@#Images\Exit-off-transparent.png
X=263
Y=1
W=46
H=33
MouseOverAction=[!SetOption Exit ImageName #@#Images\Exit-on.png][!UpdateMeter Exit][!Redraw]
MouseLeaveAction=[!SetOption Exit ImageName #@#Images\Exit-off-transparent.png][!UpdateMeter Exit][!Redraw]
LeftMouseUpAction=[!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"]
ToolTipText=Close

[Title]
Meter=String
X=155
Y=5
W=290
H=23
StringAlign=center
StringStyle=normal
SolidColor=0,0,0,1
FontColor=#FontColor#
FontFace=#LocalFontFace8#
FontSize=15
AntiAlias=1
Text=Languages

;FOR METRIC/IMPERIAL:
; e		This is "Imperial", using Fahrenheit for temperatures.
; m		This is "Metric", using Celsius for temperatures.
; h		This is "Hybrid", used primarily in the UK. Celsius for temperatures, but miles for distances.

[LanguageStyles]
StringAlign=left
FontFace=#LocalFontFace8#
FontColor=#FontColor3#
FontSize=11
StringStyle=normal
AntiAlias=1
MouseOverAction=[!SetOption #CURRENTSECTION# FontColor "97,147,226"][!UpdateMeter #CURRENTSECTION#][!Redraw]
MouseLeaveAction=[!SetOption #CURRENTSECTION# FontColor #FontColor3#][!UpdateMeter #CURRENTSECTION#][!Redraw]

[L1]
Meter=String
Meterstyle=LanguageStyles
X=30
Y=55
Text=English #Degrees#F 
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "English #Degrees#F" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "en-US" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#I%p" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "e" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L2]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=English #Degrees#C 
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "English #Degrees#C" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "en-CA" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L3]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Bahasa Indonesia
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Bahasa Indonesia" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "id-ID" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L4]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Bahasa Melayu
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Bahasa Melayu" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "ms-MY" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L5]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Chinese
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Chinese" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "zh-CN" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L6]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Croatian
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Croatian" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "hr-HR" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L7]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Czech 
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Czech" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "cs-CZ" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L8]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Danish
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Danish" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "da-DK" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L9]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Dutch
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Dutch" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "nl-NL" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L10]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Finnish 
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Finnish" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "fi-FI" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L11]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=French
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "French" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "fr-FR" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L12]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=German
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "German" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "de-DE" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L13]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Greek
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Greek" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "el-GR" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L14]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Hindi
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Hindi" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "hi-IN" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L15]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Hungarian
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Hungarian" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "hu-HU" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L17]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Italian 
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Italian" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "it-IT" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

;======================================================================

[L18]
Meter=String
Meterstyle=LanguageStyles
X=160
Y=55
Text=Japanese
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Japanese" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "ja-JP" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L19]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Korean
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Korean" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "ko-KR" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L20]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Norwegian
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Norwegian" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "no-NO" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L21]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Polish
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Polish" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "pl-PL" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L22]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Portuguese
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Portuguese" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "pt-BR" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L23]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Romanian
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Romanian" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "ro-RO" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L24]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Russian 
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Russian" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "ru-RU" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L25]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Slovak
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Slovak" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "sk-SK" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L26]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Spanish 
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Spanish" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "es-ES" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L27]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Swedish
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Swedish" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "sv-SE" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L28]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Tagalog
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Tagalog" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "fil-PH" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L29]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Thai
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Thai" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "th-TH" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L30]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Turkish 
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Turkish" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "tr-TR" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L31]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Ukrainian
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Ukrainian" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "uk-UA" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]

[L32]
Meter=String
Meterstyle=LanguageStyles
X=r
Y=25r
Text=Vietnamese
LeftMouseUpAction=[!WriteKeyValue Variables #VariableToWrite3# "Vietnamese" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite4# "vi-VN" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite5# "%#H" "#@#Variables.inc"][!WriteKeyValue Variables #VariableToWrite9# "m" "#@#Variables.inc"][!ActivateConfig "#ROOTCONFIG#\Settings" "#SettingstoOpen#.ini"][!RefreshApp]








